Debjit230/ESP8266-EXPERIMENT/src/main.cpp
    html += "<div class='slider-container'>";
    html += "<label>Manual Brightness: <span id='bVal' class='val-badge'>" + String(userBrightness) + "</span></label>";
    html += "<input type='range' name='bright' min='1' max='255' value='" + String(userBrightness) + "' oninput=\"document.getElementById('bVal').innerText=this.value;\">";
    html += "</div>";

    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='autodim' name='autodim' value='1'" + String(autoDimEnabled ? " checked" : "") + ">";
    html += "<label for='autodim' style='font-size:13px;cursor:pointer;color:#eee;'>Auto-dim on Lock / Clock</label>";
    html += "</div>";

    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='autolock' name='autolock' value='1'" + String(autoLockEnabled ? " checked" : "") + ">";
    html += "<label for='autolock' style='font-size:13px;cursor:pointer;color:#eee;'>Enable Auto-Lock (EMO Face)</label>";
    html += "</div>";

    html += "<div class='slider-container'>";
    html += "<label>Lock Timeout (sec): <span id='lVal' class='val-badge'>" + String(autoLockSeconds) + "s</span></label>";
    html += "<input type='range' name='locksec' min='15' max='300' step='5' value='" + String(autoLockSeconds) + "' oninput=\"document.getElementById('lVal').innerText=this.value+'s';\">";
    html += "</div>";

    html += "<hr><h3 style='margin:10px 0;color:#00bcd4;'>Schedule Birthday Wish</h3>";
    html += "<label>Wish Message:</label>";
    html += "<input type='text' name='smstext' maxlength='60' placeholder='Happy Birthday Ankita!' value=''>";
    html += "<label>Wish Date & Time:</label>";
    html += "<input type='datetime-local' name='smstime'>";

    html += "<input type='submit' value='Save & Reboot'></form></body></html>";
    server.send(200, "text/html", html);
  } else {
    server.send(200, "text/plain", "ESP-Sentinel Ready");
  }
}

void handleConfigSave() {
  String reqSSID    = server.arg("ssid");
  String reqPass    = server.arg("pass");
  String reqBright  = server.arg("bright");
  bool reqAutoDim   = server.hasArg("autodim");
  bool reqAutoLock  = server.hasArg("autolock");
  String reqLockSec = server.arg("locksec");
  String reqSmsText = server.arg("smstext");
  String reqSmsTime = server.arg("smstime");

  uint8_t newBright = userBrightness;
  if (reqBright.length() > 0) {
    int b = reqBright.toInt();
    if (b >= 1 && b <= 255) newBright = (uint8_t)b;
  }

  uint16_t newLockSec = autoLockSeconds;
  if (reqLockSec.length() > 0) {
    int ls = reqLockSec.toInt();
    if (ls >= 15 && ls <= 300) newLockSec = (uint16_t)ls;
  }

  if (reqSmsTime.length() >= 16 && reqSmsText.length() > 0) {
    struct tm targetTm;
    memset(&targetTm, 0, sizeof(struct tm));
    targetTm.tm_year = reqSmsTime.substring(0, 4).toInt() - 1900;
    targetTm.tm_mon  = reqSmsTime.substring(5, 7).toInt() - 1;
    targetTm.tm_mday = reqSmsTime.substring(8, 10).toInt();
    targetTm.tm_hour = reqSmsTime.substring(11, 13).toInt();
    targetTm.tm_min  = reqSmsTime.substring(14, 16).toInt();
    targetTm.tm_sec  = 0;
    targetTm.tm_isdst = 0;

    time_t parsedEpoch = mktime(&targetTm);
    if (parsedEpoch > 0) {
      parsedEpoch -= gmtOffset_sec;
      saveScheduledSms((uint32_t)parsedEpoch, reqSmsText);
    }
  }

  if (reqSSID.length() > 0) {
    saveSettings(reqSSID, reqPass, newBright, reqAutoDim, reqAutoLock, newLockSec);
    setOledBrightness(newBright);

    String html = "<html><body style='background:#121212;color:#eee;text-align:center;padding:40px;font-family:Arial;'>";
    html += "<h2>Settings Saved!</h2><p>Rebooting...</p></body></html>";
    server.send(200, "text/html", html);
    delay(1500);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "SSID cannot be empty.");
  }
}

void configureMode(DeviceMode newMode) {
  currentMode = newMode;
  display.clearDisplay();
  setOledBrightness(userBrightness);

  server.stop();
  wifi_promiscuous_enable(0);
  irrecv.disableIRIn();
  shutoffLeds();
  alertLedActive = false;

  switch (currentMode) {
    case MODE_RADAR:
      WiFi.persistent(false);
      WiFi.disconnect();
      WiFi.mode(WIFI_STA);
      wifi_set_opmode(STATION_MODE);
      wifi_promiscuous_enable(0);
      wifi_set_promiscuous_rx_cb(snifferCallback);
      wifi_promiscuous_enable(1);
      break;

    case MODE_SCANNER:
      WiFi.mode(WIFI_STA);
      WiFi.disconnect();
      totalNetworksFound = 0;
      triggerWifiScan();
      lastScanTime = millis();
      break;

    case MODE_RF_TRIPWIRE:
      WiFi.mode(WIFI_STA);
      WiFi.setSleepMode(WIFI_NONE_SLEEP);
      WiFi.begin(target_ssid, target_password);
      baselineInitialized = false;
      isCalibrating = false;
      calibrationStartTime = 0;
      maxNoiseObserved = 0.0;
      for (int i = 0; i < WAVE_POINTS; i++) waveBuffer[i] = 42;
      break;

    case MODE_IR_DECODER:
      WiFi.disconnect();
      WiFi.mode(WIFI_OFF);
      irrecv.setUnknownThreshold(12);
      irrecv.enableIRIn();
      break;

    case MODE_AP_CONFIG: {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      delay(50);
      WiFi.mode(WIFI_AP_STA);

      IPAddress local_ip(192, 168, 4, 1);
      IPAddress gateway(192, 168, 4, 1);
      IPAddress subnet(255, 255, 255, 0);
      WiFi.softAPConfig(local_ip, gateway, subnet);
      WiFi.softAP(AP_CONFIG_SSID, AP_CONFIG_PASS, 1, 0, 4);

      server.begin();
      break;
    }
  }
}

void enterLockScreen() {
  isDeviceLocked = true;
  isClockModeActive = false;
  isPeekClockActive = false;
  resumeMode = currentMode;

  shutoffLeds();
  alertLedActive = false;

  if (autoDimEnabled) {
    uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
    setOledBrightness(dimLevel);
  } else {
    setOledBrightness(userBrightness);
  }

  if (isNightWindow()) {
    currentEmotion = EMO_SLEEP;
  } else if (isMorningWindow()) {
    setEmotion(EMO_LOVE);
  } else {
    currentEmotion = EMO_NORMAL;
  }

  display.clearDisplay();
  display.display();
}

void unlockDevice() {
  isDeviceLocked = false;
  isPeekClockActive = false;
  isSmsAlertActive = false;
  lastUserActivity = millis();

  setOledBrightness(userBrightness);
  display.clearDisplay();
  configureMode(resumeMode);
}

void drawDeskBuddyEye(int x, int y, int w, int h, int pupilShiftX, int pupilShiftY) {
  if (h <= 4) {
    display.fillRoundRect(x, y + 13, w, 4, 2, SSD1306_WHITE);
    return;
  }

  int cornerRadius = 9;
  if (h < 18) cornerRadius = h / 2;

  display.fillRoundRect(x, y, w, h, cornerRadius, SSD1306_WHITE);

  int pupilW = 10;
  int pupilH = (h > 16) ? 10 : (h - 6);
  if (pupilH < 3) pupilH = 3;

