Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  int pupilCenterX = x + (w / 2) + pupilShiftX;
  int pupilCenterY = y + (h / 2) + pupilShiftY;

  display.fillRoundRect(pupilCenterX - (pupilW / 2), pupilCenterY - (pupilH / 2), pupilW, pupilH, 3, SSD1306_BLACK);
}

void drawHappyArchedEye(int x, int y, int w) {
  display.fillRoundRect(x, y, w, 18, 9, SSD1306_WHITE);
  display.fillRoundRect(x, y + 6, w, 18, 9, SSD1306_BLACK);
}

void drawSmallHeart(int x, int y) {
  display.fillCircle(x - 2, y, 2, SSD1306_WHITE);
  display.fillCircle(x + 2, y, 2, SSD1306_WHITE);
  display.fillTriangle(x - 4, y, x + 4, y, x, y + 5, SSD1306_WHITE);
}

void drawAutoLockBanner() {
  display.clearDisplay();
  display.drawRoundRect(10, 14, 108, 36, 6, SSD1306_WHITE);
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(24, 20);
  display.print("AUTO-LOCK:");
  display.setTextSize(2);
  display.setCursor(44, 32);
  display.print(autoLockEnabled ? "ON" : "OFF");
  display.display();
}

// Fixed Birthday Wish UI: Clean scroll with alternating hearts[cite: 7]
void drawBirthdayWishUI() {
  unsigned long now = millis();
  unsigned long elapsed = now - smsAlertStartTime;

  // 4 seconds marquee text, then 2 seconds heart face
  unsigned long cycleTime = elapsed % 6000;

  if (cycleTime > 4000) {
    display.clearDisplay();
    drawHappyArchedEye(24, 21, 30);
    drawHappyArchedEye(74, 21, 30);
    drawSmallHeart(64, 19);
    display.display();
  } else {
    int strLen = strlen(scheduledSmsText);
    int textPixelWidth = (strLen > 0) ? (strLen * 12) : 100;

    if (now - lastMarqueeShift >= 25) {
      lastMarqueeShift = now;
      marqueeScrollX -= 3;
      if (marqueeScrollX < -textPixelWidth) {
        marqueeScrollX = SCREEN_WIDTH;
      }
    }

    display.clearDisplay();
    display.setTextSize(2);
    display.setTextWrap(false);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(marqueeScrollX, 24);
    display.print(scheduledSmsText);
    display.display();
  }
}

void checkScheduledSms() {
  if (scheduledSmsEpoch == 0 || isSmsAlertActive) return;

  time_t now = time(nullptr);
  if (now < 100000) return;

  if ((uint32_t)now >= scheduledSmsEpoch) {
    isSmsAlertActive = true;
    smsAlertStartTime = millis();
    marqueeScrollX = SCREEN_WIDTH;
    setOledBrightness(userBrightness); // Wake to full brightness
    triggerLedAlert();
    clearScheduledSms();
  }
}

void drawEmoFace() {
  unsigned long now = millis();

  if (currentEmotion != EMO_NORMAL && currentEmotion != EMO_SLEEP) {
    if (now - emotionHoldStartTime > EMOTION_HOLD_MS) {
      currentEmotion = isNightWindow() ? EMO_SLEEP : EMO_NORMAL;
    }
  } else {
    if (isNightWindow()) {
      currentEmotion = EMO_SLEEP;
    }
  }

  display.clearDisplay();

  const int eyeW = 30;
  const int leftEyeBaseX = 24;
  const int rightEyeBaseX = 74;
  const int eyeBaseY = 17;

  if (currentEmotion == EMO_LOVE) {
    drawHappyArchedEye(leftEyeBaseX, eyeBaseY + 4, eyeW);
    drawHappyArchedEye(rightEyeBaseX, eyeBaseY + 4, eyeW);
    drawSmallHeart(64, eyeBaseY + 2);
    display.display();
    return;
  }

  if (currentEmotion == EMO_SLEEP) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);

    if (now - lastZzzAnim > 350) {
      lastZzzAnim = now;
      zzzStep = (zzzStep + 1) % 4;
    }
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    if (zzzStep >= 1) { display.setCursor(98, 22); display.print("z"); }
    if (zzzStep >= 2) { display.setCursor(106, 14); display.print("Z"); }
    if (zzzStep >= 3) { display.setCursor(114, 6);  display.print("Z"); }

    display.display();
    return;
  }

  if (currentEmotion == EMO_SHOCKED) {
    int lx = leftEyeBaseX + 15;
    int rx = rightEyeBaseX + 15;
    int cy = eyeBaseY + 15;
    display.fillCircle(lx, cy, 18, SSD1306_WHITE);
    display.fillCircle(rx, cy, 18, SSD1306_WHITE);
    display.fillCircle(lx, cy, 6, SSD1306_BLACK);
    display.fillCircle(rx, cy, 6, SSD1306_BLACK);
    display.display();
    return;
  }

  if (currentEmotion == EMO_SUSPICIOUS) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillTriangle(leftEyeBaseX, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 14, SSD1306_BLACK);
    display.fillTriangle(rightEyeBaseX, eyeBaseY + 8, rightEyeBaseX + eyeW, eyeBaseY + 8, rightEyeBaseX, eyeBaseY + 14, SSD1306_BLACK);
    display.fillRect(leftEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);
    display.fillRect(rightEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);
    display.display();
    return;
  }

  if (currentEmotion == EMO_WINK) {
    drawDeskBuddyEye(leftEyeBaseX, eyeBaseY, eyeW, 30, 0, 0);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 4, 2, SSD1306_WHITE);
    display.display();
    return;
  }

  if (!isBlinking && (now - lastEyeTargetShift > (unsigned long)random(2400, 4500))) {
    lastEyeTargetShift = now;
    if (random(0, 100) < 35) {
      isBlinking = true;
      blinkStartTime = now;
      targetEyeH = 4.0;
    } else {
      targetEyeX = random(-7, 8);
      targetEyeY = random(-4, 5);
    }
  }

  if (isBlinking && (now - blinkStartTime > 130)) {
    isBlinking = false;
    targetEyeH = 30.0;
  }

  currentEyeX += (targetEyeX - currentEyeX) * 0.25;
  currentEyeY += (targetEyeY - currentEyeY) * 0.25;
  currentEyeH += (targetEyeH - currentEyeH) * 0.35;

  int renderH = constrain((int)currentEyeH, 4, 30);
  int lx = constrain(leftEyeBaseX + (int)currentEyeX, 4, 46);
  int rx = constrain(rightEyeBaseX + (int)currentEyeX, 54, 96);
  int y  = constrain(eyeBaseY + (int)currentEyeY + (30 - renderH) / 2, 6, 32);

  int pupilOffsetX = constrain((int)(currentEyeX * 0.5), -4, 4);
  int pupilOffsetY = constrain((int)(currentEyeY * 0.5), -3, 3);

  drawDeskBuddyEye(lx, y, eyeW, renderH, pupilOffsetX, pupilOffsetY);
  drawDeskBuddyEye(rx, y, eyeW, renderH, pupilOffsetX, pupilOffsetY);

