Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  if (!target_ssid[0]) return;

  WiFi.mode(WIFI_STA);
  WiFi.begin(target_ssid, target_password);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 8000) {
    delay(100);
    if (digitalRead(BUTTON_PIN) == LOW) {
      configureMode(MODE_AP_CONFIG);
      return;
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    display.clearDisplay();
    display.setCursor(0, 18);
    display.println("Wi-Fi Connected!");
    display.setCursor(0, 34);
    display.println("Syncing NTP Time...");
    display.display();

    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

    time_t now = time(nullptr);
    start = millis();
    while (now < 100000 && millis() - start < 4000) {
      delay(200);
      now = time(nullptr);
    }
  }
}

void setup() {
  pinMode(EXTERNAL_LED, OUTPUT);
  pinMode(BOARD_LED, OUTPUT);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(IR_RECV_PIN, INPUT_PULLUP);

  shutoffLeds();

  Serial.begin(115200);
  delay(100);

  loadCredentials();

  server.on("/", handleRoot);
  server.on("/save", HTTP_POST, handleConfigSave);

  Wire.begin(OLED_SDA, OLED_SCL);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.setRotation(2);
  display.clearDisplay();
  display.display();

  setOledBrightness(userBrightness);

  syncTimeAtStartup();

  lastUserActivity = millis();

  if (isMorningWindow()) {
    enterLockScreen();
    setEmotion(EMO_LOVE);
  } else if (currentMode != MODE_AP_CONFIG) {
    configureMode(MODE_RADAR);
  }
}

void loop() {
  unsigned long currentMillis = millis();

  // 1. Alert Pulse Auto-Shutoff (120ms)
  if (alertLedActive && (currentMillis - alertLedStart >= LED_ALERT_DURATION)) {
    alertLedActive = false;
    shutoffLeds();
  }

  // 2. Periodic NTP check for scheduled birthday wish trigger
  checkScheduledSms();

  // 3. Auto-expire Birthday Wish marquee after 30 seconds
  if (isSmsAlertActive && (currentMillis - smsAlertStartTime >= SMS_DISPLAY_DURATION)) {
    isSmsAlertActive = false;
    display.clearDisplay();
  }

  // 4. Button Engine
  if (currentMillis - lastButtonCheck >= 25) {
    lastButtonCheck = currentMillis;
    bool pinState = (digitalRead(BUTTON_PIN) == LOW);

    if (pinState && !buttonIsPressed) {
      buttonIsPressed = true;
      buttonPressStartTime = currentMillis;
      holdThresholdMet = false;
    } 
    else if (pinState && buttonIsPressed) {
      unsigned long heldTime = currentMillis - buttonPressStartTime;

      if (!holdThresholdMet) {
        if (isDeviceLocked && heldTime >= 700) {
          holdThresholdMet = true;
          clickCount = 0;
          isPeekClockActive = false;
          setEmotion(EMO_LOVE);
        }
        else if (!isDeviceLocked && heldTime >= 2000) {
          holdThresholdMet = true;
          clickCount = 0;
          lastUserActivity = currentMillis;
          isClockModeActive = false;
          configureMode(MODE_AP_CONFIG);
        } 
        else if (!isDeviceLocked && heldTime >= 400) {
          display.fillRect(10, 56, (heldTime - 400) * 108 / 1600, 4, SSD1306_WHITE);
          display.display();
        }
      }
    } 
    else if (!pinState && buttonIsPressed) {
      buttonIsPressed = false;
      unsigned long duration = currentMillis - buttonPressStartTime;

      if (duration < 600 && !holdThresholdMet) {
        clickCount++;
        lastClickTime = currentMillis;

        if (isSmsAlertActive) {
          isSmsAlertActive = false;
          clickCount = 0;
          display.clearDisplay();
        }
        else if (clickCount == 2) {
          clickCount = 0;
          if (isDeviceLocked) {
            unlockDevice();
          } else {
            enterLockScreen();
          }
        }
        else if (clickCount >= 3) {
          clickCount = 0;
          saveAutoLockState(!autoLockEnabled);
          isBannerActive = true;
          bannerStartTime = currentMillis;
        }
      }
    }

    if (clickCount == 1 && (currentMillis - lastClickTime > DOUBLE_CLICK_GAP)) {
      clickCount = 0;

      if (isDeviceLocked) {
        isPeekClockActive = true;
        peekClockStartTime = currentMillis;
        display.clearDisplay();
      } else {
        lastUserActivity = currentMillis;

        if (isClockModeActive) {
          isClockModeActive = false;
          setOledBrightness(userBrightness);
          display.clearDisplay();
        } else {
          DeviceMode nextMode;
          if (currentMode == MODE_RADAR)             nextMode = MODE_SCANNER;
          else if (currentMode == MODE_SCANNER)     nextMode = MODE_RF_TRIPWIRE;
          else if (currentMode == MODE_RF_TRIPWIRE) nextMode = MODE_IR_DECODER;
          else                                      nextMode = MODE_RADAR;

          configureMode(nextMode);
        }
      }
    }
  }

  // 5. Automated Locks and Screen Savers
  if (!isDeviceLocked && currentMode != MODE_AP_CONFIG) {
    if (autoLockEnabled && (currentMillis - lastUserActivity >= (unsigned long)autoLockSeconds * 1000UL)) {
      enterLockScreen();
    } 
    else if (!isClockModeActive && (currentMillis - lastUserActivity >= CLOCK_TIMEOUT_MS)) {
      isClockModeActive = true;
      if (autoDimEnabled) {
        uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
        setOledBrightness(dimLevel);
      } else {
        setOledBrightness(userBrightness);
      }
      display.clearDisplay();
    }
  }

  if (isDeviceLocked && isPeekClockActive && (currentMillis - peekClockStartTime >= PEEK_CLOCK_DURATION)) {
    isPeekClockActive = false;
    display.clearDisplay();
  }

  if (isBannerActive && (currentMillis - bannerStartTime >= BANNER_DURATION)) {
    isBannerActive = false;
    display.clearDisplay();
  }

  // 6. UI Handlers: SMS Alert takes TOP PRIORITY over device lock and screensaver
  if (isSmsAlertActive) {
    drawBirthdayWishUI();
  } else if (isBannerActive) {
    drawAutoLockBanner();
  } else if (isDeviceLocked) {
    if (isPeekClockActive) {
      if (currentMillis - lastDisplayDraw >= 200) {
        lastDisplayDraw = currentMillis;
        drawClockUI();
      }
    } else {
      if (currentMillis - lastDisplayDraw >= 30) {
        lastDisplayDraw = currentMillis;
        drawEmoFace();
      }
    }
  } else if (isClockModeActive) {
    if (currentMillis - lastDisplayDraw >= 500) {
      lastDisplayDraw = currentMillis;
      drawClockUI();
    }
  }

  // 7. Sensor execution
  switch (currentMode) {
    case MODE_RADAR: {
      if (currentMillis - lastChannelHop >= 180) {
        lastChannelHop = currentMillis;
        currentChannel++;
        if (currentChannel > 13) currentChannel = 1;
        wifi_set_channel(currentChannel);
      }

      if (!isDeviceLocked && !isClockModeActive && !isBannerActive && !isSmsAlertActive && (currentMillis - lastDisplayDraw >= 50)) {
        lastDisplayDraw = currentMillis;
        sweepAngle += 0.15;
        if (sweepAngle >= 2 * PI) sweepAngle = 0;
        drawRadarUI();
      }
      break;
    }

